#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <time.h> 

#include "Read_And_Write_Linear.h"

int *final_array, *values;
int main(int argc , char *argv[])
{
	
	printf ("The number of arguments are %d \n", argc);
	
	for(int i=0;i<argc;i++)
	  {
		printf("%s\n",argv[i]);
	  }
		
		
	// deikths 1. sto host for start
  
	// data is a 1D array where the gauss array will be saved, already allocated into the host, it's been allocated
     final_array = ReadFile(argv[1]); 
	
    /* for(int u=0; u<info.Size;u++)
     {
    	 printf("d[%d] = %d \n",u,final_array[u]);
     }
     */
	printf("number of lines %d \n", info.lines);
	printf("number of cols %d \n", info.cols);
	printf("size %d \n", info.Size);
	
		
	printf("END \n");
	
	
	/*
	 * Δημιουργία ενός πίνακα μεγέθους όσο οι γραμμές του πίνακα γιατί
	 * όσες είναι οι γραμμές τόσοι θα είναι και οι άγνωστοι του πίνακα για την
	 * εύρεση λύσης. Αρχικοποιούμε τον πίνακα με 0. Σε αυτόν τον πίνακα θα αποθηκεύονται
	 * οι τελικές τιμές των αγνώστων. 
	 */
	 values = (int*)malloc(sizeof(int*)*info.lines);
				
     for(int h=0; h< info.lines ; h++)
		{
		     values[h]=0;
		}
	 printf("END 6\n");
	
	
	int end=0;
	
	/*
	 * Θα ξεκινήσει από την τελευταία γραμμή όπου ο αγνωστος θα είναι ίσως με την τιμή
	 * της σταθεράς στην τελευταία στήλη και θα συνεχίσει προς τα πάνω.
	 * 
	 * Πρώτα ελέγχει αν το σύστημα είναι αδύνατο/έχει άπειρες λύσεις. Αν η διαγώδιος
	 * έχει τουλάχιστον 1 μηδενικό τότε το σύστημα είναι αδύνατο/έχει άπειρες λύσεις
	 * και το πρόγραμμα τερματίζεται. 
	 * Αν όχι τότε συνεχίζει στην εύρεση των τιμών των αγνώστων του συστήματος.
	 * Μόλις βρίσκει τη τιμή ενός αγνώστου την αποθηκεύει στον πίνακα values.
	 * Σε κάθε γραμμή, πέρα της τελευταίας, κάνει xor τους αγνώστους που έχουν
	 * συντελεστή 1 (δηλαδή η στήλη στην οποία βρίσκεται ο άγνωστος πχ στη στήλη 4(που δεν είναι η σταθερά στήλη)
	 * ανήκει ο άγνωστος x4), μεταξύ τους, εκτός του αγνώστου που ψάχνουμε να βρούμε την τιμή. 
	 * Μετά κάνει xor το προγούμενο αποτελεσμα του xor με τη σταθερά της τελευταίας στήλης
	 * στην αντίστιχη γραμμή για να βρούμε την τιμή του αγνώστου που ψάχνουμε. Αποθηκεύει
	 * την τιμή που βρήκε στον πίνακα values, στην αντίστοιχη θέση της γραμμής που βρισκόμαστε. 
	 * (δηλαδή αν έχουμε 5 γραμμές, ο αγνωστος x4 θα αποθηκεύσει την τιμή του στη values[4], 
	 * ο αγνωστος x3 στη values[3] κτλ.
	 * 
	 */
	for (int i = info.lines-1 ; i >= 0 ; i--) // από την τελευταία γραμμή προς τη 0.
	{
		int current_col = i; // στηλη στην οποία βρισκόμαστε
		int at = (info.cols + 1) * i; // θεση στη διαγωνιο της γραμμής που βρισκόμαστε
		printf(" at = %d \n",at);
		printf(" i = %d \n",i);
		int d = 5; // γενικά για αργότερο έλεγχο
		
		if (final_array[at] == 0 ) // αν βρεις στοιχείο στη διαγώνιο που είναι 0 τότε σταμάτα το πρόγραμμα.
		{
			printf("Λυσεις ειναι ειτε απειρες ειτε καμια. \n");
			end=1;
			break;
		}
		else //αλλιώς βρες τις λύσεις
		{
			int A;
			// αν η στήλη στην οποία βρισκόμαστε είναι η τελευταία στήλη του τετραγωνικού πίνακα
			//δηλαδή η στήλη πριν τη στηλη με τις σταθερές (προτελευταία)
			if ( current_col == (info.lines-1) ) 
			{
				A = final_array[at]; // παρε την τιμή της θέσης της διαγωνίου στην τελευταία γραμμή
				printf("A = %d teleytaia grammh \n", A);
				int stathera = at + 1; // η τιμή της σταθεράς βρίσκεται στην ακριβώς επόμενη θέση
				printf("stathera = %d \n", stathera);
				
				values[current_col]=final_array[stathera]; // αποθήκευσε την τιμή της θεσης στη στήλη των σταθερών στην θέση της
				                                           // στήλης/γραμμής που βρισκόμαστε
				
			}
			else // αν δεν είναι στην τελευταία γραμμή
			{
				
				//Για κάθε στήλη, εκτός της στήλης που βρισκόμαστε επειδή που περιέχει τον άγνωστο που ψάχνουμε,
				//από την τελευταία στήλη του τετραγωνικου πίνακα (στήλη πριν τη στήλη με τις σταθερές)
				//μέχρι τη στήλη πριν τη στήλη που βρίσκεται ο αγνωστος που ψάχνουμε
				for (int j = (info.lines-1); j != current_col ; j--) 
				{
					
					printf( " j = %d \n", j);
					int perisema = j-current_col; // απόσταση μεταξύ στηλών
					printf("perisema = %d \n", perisema);
					int at2 = at + perisema; // οι θεσεις που χρειαζόμαστε βρίσκονται στην ίδια γραμμή
					printf("at2 = %d thesh poy elegxw meta th diagwnio \n", at2);
					if( final_array[at2] == 1) // αν έχει συντελεστή 1 μπορώ να τη χρησιμοποιήσω στο xor
					{
						if(d == 5) // αν το d είναι 5 τότε σημαίνει ότι βρισκόμαστε στην πρώτη θέση του συνόλου που θα γίνει xor
						{
							d = values[j];// πάρε την τιμή από τη λίστα με τα values (αλλαξε το 5)
						}
						else
						{
							d = d ^ values[j]; // κάνε xor με τη νέα μεταβλητή
						}
						
						printf("d = %d \n", d);
						
					}
				}
				
				int f;
				
				// Τώρα θα βρει την τιμή του αγνώστου που ψάχνουμε
				int per = info.lines - current_col;
				int stathera = at + per; // θέση που βρίσκεται η σταθερά της γραμμής που βρισκόμαστε
				printf("stathera = %d \n", stathera);
				if(d == 5)// αν το d είναι ακόμα 5 σημαίνει ότι δεν υπήρχε καμία στήλη με 1 μέχρι το τέλος 
				{
					f = final_array[stathera]; //επομένως ο άγνωστος θα πάρει την τιμή της σταθεράς
				}
				else
				{
				 f = d ^ final_array[stathera]; // xor το σύνολο από πριν με τη σταθερά (αντίστροφο του xor είναι το xor)
				}
				printf("f = %d teliko \n",f);
				values[current_col] = f;
			
			} 
			
		} 

	}
	
	
	//εμγάνιση των τιμών των αγνώστων
	if(end == 0)
	{
		for (int g=0; g < info.lines ; g++)
			{
				printf(" values[%d] = %d \n",g, values[g]);
			}
	}
	
	free(values);
	free(final_array);
	
	
}